# ACT plugin for GITHUB actions
brew 'act'
brew 'argocd'
brew 'awscli'
brew 'aws-iam-authenticator'
brew 'aws-sam-cli'
brew 'awscli'
brew 'bash-completion'

brew 'bat'
brew 'calicoctl'
brew 'docker'
brew 'dos2unix'
# EKSCTL for AWS for EKS (kubernetes)
brew 'eksctl'
brew 'fontconfig'
# GIT command line for local repos and version control
brew 'git'
brew 'gh'
brew 'go'
brew 'helm'

#IstioCtl upgraded, so reset PATH
brew "istioctl"
# KUBECTL from kubernetes.io
brew 'k6'
brew 'k9s'
brew 'kubeaudit'
brew 'kubectl'
brew 'kubectx'
brew 'kustomize'
brew 'helm'
brew 'minikube'
brew 'nmap'

# PYTHON preference to other langs
brew 'python@3.11'
brew 'redis'
brew 'sipcalc'
brew 'terrascan'

##########
## CASKS
##########
cask 'authy'
cask 'firefox'
# GITHUB desktop for GitHub repos etc
cask 'github'
cask 'google-chrome'
# INTELLIJ
cask 'intellij-idea-ce'
cask 'iterm2'
cask 'keepassxc'
# VISUAL STUDIO CODE
cask 'visual-studio-code'
